{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"2d54d756-686e-5876-bac0-926caeaf244d","excerpt":"\nRefactoring is scary. I've seen some comments on Twitter indicating that it's generally something really risky, sending tremors through the rest of the team. It's true, it's risky, but it's generally for the better. But I often need to refactor something a bit more scary: <b>life</b>.\n","html":"<p>Refactoring is scary. I’ve seen some comments on Twitter indicating that it’s generally something really risky, sending tremors through the rest of the team. It’s true, it’s risky, but it’s generally for the better. But I often need to refactor something a bit more scary: <b>life</b>.</p>\n<!--excerpt-->\n<p>Here’s what I see:</p>\n<blockquote class=\"twitter-tweet tw-align-center\" lang=\"en\"><p lang=\"en\" dir=\"ltr\">Don&#39;t you hate it when one of your bits of code is pivotal, but also a big scary mess? I need to edit it, but I&#39;m scared to refactor. *sob*</p>&mdash; Hayden Scott-Baron (@docky) <a href=\"https://twitter.com/docky/status/622462937849036800\">July 18, 2015</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<blockquote class=\"twitter-tweet tw-align-center\" lang=\"en\"><p lang=\"en\" dir=\"ltr\">&quot;I&#39;m scared. I just did a 40 file refactor and it worked.&quot; -me&#10;&quot;First time?&quot; -<a href=\"https://twitter.com/sangster\">@sangster</a>&#10;&quot;First compile&quot; -me&#10;&quot;...thats not good&quot; - <a href=\"https://twitter.com/sangster\">@sangster</a></p>&mdash; Will Long (@DerailedLogic) <a href=\"https://twitter.com/DerailedLogic/status/509788312953815040\">September 10, 2014</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<blockquote class=\"twitter-tweet tw-align-center\" lang=\"en\"><p lang=\"en\" dir=\"ltr\">One of the reasons I love TDD, Java, and IntelliJ: you are never scared to rename and refactor anything. Big refactorings done in seconds.</p>&mdash; Sandro Mancuso (@sandromancuso) <a href=\"https://twitter.com/sandromancuso/status/621435441271672832\">July 15, 2015</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Oy. Too bad there aren’t automated tests for life.</p>\n<figure>\n  <img src=\"{{ site.baseurl }}/images/continue.png\" />\n</figure>\n<h2>Summary</h2>\n<p><strong>TL;DR</strong></p>\n<ol>\n<li>Find what you enjoy.</li>\n<li>Trim what’s in the way.</li>\n<li>Leaps of faith</li>\n<li>Go camping to get feedback.</li>\n</ol>\n<h2>Why life is worth retrying</h2>\n<p>I’ve been chasing something for 10 years, but haven’t quite figured out what it is. I suppose I still don’t <em>really</em> know, but it’s a journey.</p>\n<p>Something clicked in college. College: that time when all your social structure upends from high school and you really “find yourself;” It’s a real Louis-and-Clark moment for determining what life should be for yourself. TLC would suggest that you need to <a href=\"https://www.youtube.com/watch?v=8WEtxJ4-sh4\">stick to the lakes and the rivers that you’re used to</a>.</p>\n<p>I didn’t though; I wanted to be a better person. One of my friends once told me that I had zero tact. Guess I was a little too rough around the edges. So I went to Johnson University to chase a Church Leadership and Preaching degree. Didn’t care much for being a pastor, but I knew that they often possessed the skills for navigating the one thing I was apparently terrible at: <em>people</em>.</p>\n<p>Then graduation from college, but I had no real career path. Again, my social structure upended. I found a job at a book company working with eBooks. It’s pretty neat.</p>\n<p>Reaching back to my interests, computers and logical flow always seemed to pull me in. I exceled at work because it was techy and computer-y. There was a ton of vacuum that I was able to explore and fill the vacuum.</p>\n<p>But that’s not WHY yet…</p>\n<p>I found what I enjoyed. Once you find what you enjoy, life becomes worth retrying. It’s not something you chase, it’s an outcome of enjoying who you are, enjoying what you do, and being enjoyed. Life’s worth it. I wanted more of it.</p>\n<p>Sorry it’s not more philosophical, but on the other hand, do you really want it to be? I like simplicity.</p>\n<figure>\n  <img src=\"{{ site.baseurl }}/images/thispleasesme.gif\">\n</figure>\n<h2>What are the big blockers?</h2>\n<p>My experience: the blockers are yourself and fear. I think I started caring too much about what other people thought and had a deep problem called <a href=\"https://en.wikipedia.org/wiki/Impostor_syndrome\">Imposter Syndrome</a>. Ultimately, I reasoned somehow that my accomplishments weren’t valid, and that I constantly needed to be <del>liked</del> <del>cared</del> <strong>LOVED</strong> by everyone. When that happens, you stop knowing about yourself and what <em>you’re</em> about since you’re constantly thinking about what others want.</p>\n<p>Tough place to be.</p>\n<p>Naming the issue helped me. Articulating it. Talking about it. Sharing it. Pushing your emotional boundaries and revealing yourself a bit more---but you know that will come with its own set of risks. That’s where the fear feels intense.</p>\n<p>It took me <em>years</em> to do this.</p>\n<h2>Who’s helping, who’s not?</h2>\n<p>I’ve been really lucky; I have a distint (not the lucky part) but encouraging family. When I think about families, I have this ideology that they’re close, bonded, and ‘all up in yo businass’; but I didn’t get born into that family. Yes my family cares, but they have their own lives and interests, and time only adds more distance if effort isn’t applied. In my case, not much effort (regrettably) has been applied.</p>\n<p><em>They help</em>. Regardless of all above, they care and they help so they’re sticking around and I always remind myself to add effort to the relationships. Same goes for friendships.</p>\n<p>At work, there are certain folks that are really enjoyable to be around in moments. They really rock at their jobs and they’re pleasant to work around. That’s where it stops though, because on the personal level they are absolute <em>drags</em> to be around. Debbie-downers, Dan-drowners.</p>\n<p><em>They don’t help</em>. They’re at work, so you can’t toss them, and they’re definitely not worthless. They’re just not helping you refactor your life to find joy. Honestly, they might just need to refactor their own lives. If you are drawn to them, then help identify areas of refactoring-need but try to remember that they are not a charity, they are people.</p>\n<figure>\n  <img src=\"{{ site.baseurl }}/images/newman.gif\">\n</figure>\n<p><strong>TL;DR</strong>: Stay with those that encourage and help you. Lose the ones that don’t enourage you and add needless stress. Stress is definitely something that needs to refactored OUT.</p>\n<h2>When to refactor life</h2>\n<p>You’ll know. It’s when you determine if you’re unhappy or depressed. Pretty simple. No long section here.</p>\n<h2>How I did it</h2>\n<p>Refactor sometimes means <code class=\"language-text\">.strip</code>. Sometimes it means <code class=\"language-text\">.sort</code> or even <code class=\"language-text\">.sort!</code>, or <code class=\"language-text\">.order</code>-ing your priorities according to their <code class=\"language-text\">:worth</code> so you can make <code class=\"language-text\">self.satisfied?</code> true.</p>\n<figure>\n  <img src=\"{{ site.baseurl }}/images/sokoban.png\" />\n</figure>\n<h3>Leap of faith</h3>\n<p>I think this one is universal. You’ll have to take some leapy faiths if you want change. This will look like a couple things:</p>\n<ul>\n<li>Leaving behind someone you’ve known for years.</li>\n<li>Moving.</li>\n<li>Get a different job.</li>\n<li>Going somewhere you’ve never been.</li>\n<li>Being social, like going to a meetup.</li>\n<li>Spending gobs of money to go back to school.</li>\n<li>Counseling. Yes, this is a leap of faith.</li>\n<li>Talking about your darkness to someone you don’t know whether you trust yet.</li>\n<li>Talking about your bright moments to someone in the dark. (careful)</li>\n</ul>\n<p>Out of these experiences, you’ll naturally have to refactor. Moving and going to school is obvious. The others are just risking your “perfect image” you’ve crafted. Believe me, it’s worth breaking that mirror. There is no perfection of self. <a href=\"http://www.esvbible.org/Ecclesiastes+1/\">Don’t chase after the wind</a>.</p>\n<p>Be careful about talking about your bright moments to someone who’s depressed; this may not have the result you’re hoping. Depression is a maze of confusion.</p>\n<h3>Trim</h3>\n<p>Once you’ve faithfully leaped toward experiences, you’ll have a better idea of what wasn’t helping. This is your moment to take another leap of faith and <code class=\"language-text\">self.strip!</code> out some of the things that weren’t helping.</p>\n<p>You know another big thing I trimmed? My beard. <img style=\"width: 1.5em; height: 1.5em; margin-bottom: 0;\" src=\"{{ site.baseurl }}/images/smiley_trollface.png\" /></p>\n<figure>\n  <img src=\"{{ site.baseurl }}/images/cutitout.gif\">\n</figure>\n<p>Don’t just keep reflecting on your experiences. Take action on those and keep doing the things you enjoy, and stop doing the things that are not enjoyable (except for adulting; unfortunately that is the curse of adulthood).</p>\n<figure>\n  <img src=\"{{ site.baseurl }}/images/camping.jpg\" />\n</figure>\n<h3>Go Camping</h3>\n<p>Short feedback loops are good. Don’t spend too much time exploring and trimming without knowing the path is good.</p>\n<p>For example, when you’re hiking, if you choose a 10 mile route, you’re pretty much stuck on that path until you decide it’s not the one, or you reach the end of it, or you go off the path entirely. I’m not saying don’t take long hikes, I’m just saying that you need to hike 1 mile and decide if the journey is worth it, and if not then you’ve only gone 1 mile and not 10. Turn around and try a different path or make your own.</p>\n<p>Camping is one of those excellent moments to get some feedback from yourself and others. I don’t know what it is, but something about staring into a fire and eating marshmallows causes a group to talk about deep stuff.</p>\n<p><em>Don’t trust everything though. Some feedback is biased</em>.</p>\n<h3>Conclusion</h3>\n<p>I really hope this helps someone out there! Hit me up <a href=\"https://twitter.com/bernheisel\">@bernheisel</a></p>","frontmatter":{"title":"Refactor","date":"September 24, 2015"}}},"pageContext":{"slug":"/refactor/","previous":{"fields":{"slug":"/hi-folks/"},"frontmatter":{"title":"New Beginnings"}},"next":{"fields":{"slug":"/developer-life-after-boot-camp/"},"frontmatter":{"title":"Developer Life After A Bootcamp"}}}}